/*
1716. 计算力扣银行的钱
Hercy 想要为购买第一辆车存钱。他 每天 都往力扣银行里存钱。

最开始，他在周一的时候存入 1 块钱。从周二到周日，他每天都比前一天多存入 1 块钱。在接下来每一个周一，他都会比 前一个周一 多存入 1 块钱。

给你 n ，请你返回在第 n 天结束的时候他在力扣银行总共存了多少块钱。

 

示例 1：

输入：n = 4
输出：10
解释：第 4 天后，总额为 1 + 2 + 3 + 4 = 10 。
示例 2：

输入：n = 10
输出：37
解释：第 10 天后，总额为 (1 + 2 + 3 + 4 + 5 + 6 + 7) + (2 + 3 + 4) = 37 。注意到第二个星期一，Hercy 存入 2 块钱。
示例 3：

输入：n = 20
输出：96
解释：第 20 天后，总额为 (1 + 2 + 3 + 4 + 5 + 6 + 7) + (2 + 3 + 4 + 5 + 6 + 7 + 8) + (3 + 4 + 5 + 6 + 7 + 8) = 96 。
*/
/*
    思路：没想到贪心相关，脑子想了两种方案。
        1.暴力模拟
        每过一周。更新一下每行开始的值为行数。
        2.找规律
        这个题数字间规律性太强了。
         先看行数：1 2 3 4 5 6 7   和为28  28
                 2 3 4 5 6 7 8   和为35  28+(1*7)
                 3 4 5 6 7 8 9   和为42  28+(2*7)
                 4 5 6
        每行和相差7.但是第一行和第三行，和相差2*7
                      第一行和第四行，和相差3*7
        因此。先将n/7，先计算完整行数k的和。即28+[28+(1*7)]+[28+(2*7)]...+[28+(k-1)*7]
        完整行数的和。28*k+(0+1+2+3+4+(k-1))*7  即28*k+[(k-1)*k/2]*7
        最后一行的和。比如第四行。4+5+6   它为(1+3)+(2+3)+(3+3)
        可利用mod=n%7。第四行第mod列为目标值。 (1+2+...+mod)+(k*mod)  为(1+mod)*mod/2+k*mod
        故可返回28*k+7*(k)*(k-1)/2+(1+mod)*mod/2+mod*k
*/

var totalMoney = function(n) {
    let sum=0,startVal=0
    for(let i=1;i<=n;i++){
        if(i%7==1){
            startVal=parseInt(i/7)
        }
        startVal++
        sum+=startVal
    }
    return sum
};

/*
    时间复杂度：O(N)
    空间复杂度：O(1)
*/
var totalMoney = function(n) {
    let k=parseInt(n/7),mod=n%7
    return 28*k+7*(k)*(k-1)/2+(1+mod)*mod/2+mod*k
};

/*
    时间复杂度：O(1)
    空间复杂度：O(1)
*/
